Autodesk.Revit.DB.FilteredWorksetCollector.WherePasses(Autodesk.Revit.DB.WorksetFilter)
Applies a workset filter to the collector.
Remarks:
The filter will be added as an additional condition that all filtered worksets must pass.
If you have an active iterator to this collector it will be stopped by this call.
filter:
The workset filter.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.#ctor(Autodesk.Revit.DB.Document)
Constructs a new FilteredWorksetCollector that will search and filter the set of worksets in a document.
document:
The document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012